testdata/in/greater-block/src.org
#+BEGIN_SRC javascript
console.log("hello world!")
#+END_SRC

test new line

#+BEGIN_QUOTE
Earth’s cry ascends,
But before it touches Heaven’s Eye,
  It returns.
#+END_QUOTE

#+BEGIN_NOTDEFINED javascript
console.log("hello world!")
#+END_NOTDEFINED

#+BEGIN_VERSE
Earth’s cry ascends,
But before it touches Heaven’s Eye,
 It returns.
#+END_VERSE

#+BEGIN_SRC bash
  #!/bin/bash
  uname -a
#+END_SRC

#+begin_src bash
  #!/bin/bash
  uname -a
#+end_src


#+BEGIN_EXAMPLE
# this shouldn't crash ;_;
# Create custom menu entries by defining a label and a link for
# them. Since you can also link posts, you've the option the
# place the links before or after them.
#
# E.g.: "Home" appears before all linked posts in the menu
# and "Tags" / "Categories" after them.
#+END_EXAMPLE

#+BEGIN_SRC sh
echo "foo"

echo "bar"
#+END_SRC


  #+BEGIN_SRC sh
    echo "foo"
  #+END_SRC

: Fixed width area

: Line 1
:    Line 2


Here is an example
    : Some example from a text file.

Here is another example
    :             Some example from a text file.


#+RESULTS[26164fcdb01a7c6a9329d20d4754e15f7739ad20]:
: Hello, World!
: The output of this code can be seen in the post.
