generate/snapshots/greater-block/src.org.html
<div>
<pre class="src javascript">
console.log("hello world!")

</pre>
<p>
test new line
</p>
<blockquote>
<p>
Earth’s cry ascends,
But before it touches Heaven’s Eye,
  It returns.

</p>
</blockquote>
<div class="NOTDEFINED">console.log("hello world!")
</div>
<div class="verse">Earth’s cry ascends,<br />
But before it touches Heaven’s Eye,<br />
 It returns.<br />
</div>
<pre class="src bash">
  #!/bin/bash
  uname -a

</pre>
<pre class="src bash">
  #!/bin/bash
  uname -a

</pre>
<pre class="example">
# this shouldn't crash ;_;
# Create custom menu entries by defining a label and a link for
# them. Since you can also link posts, you've the option the
# place the links before or after them.
#
# E.g.: "Home" appears before all linked posts in the menu
# and "Tags" / "Categories" after them.

</pre>
<pre class="src sh">
echo "foo"

echo "bar"

</pre>
<pre class="src sh">
    echo "foo"
  
</pre>
<pre class="example">
 Fixed width area
</pre>
<pre class="example">
 Line 1
    Line 2
</pre>
<p>
Here is an example
    
</p>
<pre class="example">
 Some example from a text file.
</pre>
<p>
Here is another example
    
</p>
<pre class="example">
             Some example from a text file.
</pre>
<pre class="example">
 Hello, World!
 The output of this code can be seen in the post.
</pre>

</div>
